# https://www.runoob.com/python/python-100-examples.html
# 1.    题目：有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
# 2.    题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
# 3.    题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
# 4.    题目：输入某年某月某日，判断这一天是这一年的第几天？
# 5.    题目：输入三个整数x,y,z，请把这三个数由小到大输出。
# 6.    题目：斐波那契数列。
# 7.    题目：将一个列表的数据复制到另一个列表中。
# 8.    题目：输出 9*9 乘法口诀表。
# 9.    题目：暂停一秒输出。
# 10.   题目：暂停一秒输出，并格式化当前时间。
# 11.   题目：古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？
# 12.   题目：判断101-200之间有多少个素数，并输出所有素数。
# 13.   题目：打印出所有的"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该数本身。例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。
# 14.
# 15.
# 16.
# 17.
# 18.
# 19.
# 20.
# 21.
# 22.
# 23.
# 24.
# 25.
# 26.
# 27.
# 28.
# 29.
# 30.
# 31.
# 32.
# 33.
# 34.
# 35.
# 36.
# 37.
# 38.
# 39.
# 40.
# 41.
# 42.
# 43.
# 44.
# 45.
# 46.
# 47.
# 48.
# 49.
# 50.
# 51.
# 52.
# 53.
# 54.
# 55.
# 56.
# 57.
# 58.
# 59.
# 60.
# 61.
# 62.
# 63.
# 64.
# 65.
# 66.
# 67.
# 68.
# 69.
# 70.
# 71.
# 72.
# 73.
# 74.
# 75.
# 76.
# 77.
# 78.
# 79.
# 80.
# 81.
# 82.
# 83.
# 84.
# 85.
# 86.
# 87.
# 88.
# 89.
# 90.
# 91.
# 92.
# 93.
# 94.
# 95.
# 96.
# 97.
# 98.
# 99.
# 100.
