# 题目：企业发放的奖金根据利润提成。
# 利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
#
# 程序分析：请利用数轴来分界，定位。


# 循环条件调用
def method_1(i):
    arr = [1000000, 600000, 400000, 200000, 100000, 0]
    rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
    r = 0
    for idx in range(0, 6):
        if i > arr[idx]:
            r += (i - arr[idx]) * rat[idx]
            i = arr[idx]
    return r


# 递归调用
def method_2(i):
    if i > 1000000:
        return (i - 1000000) * 0.01 + method_2(1000000)
    elif i > 600000:
        return (i - 600000) * 0.015 + method_2(600000)
    elif i > 400000:
        return (i - 400000) * 0.03 + method_2(400000)
    elif i > 200000:
        return (i - 200000) * 0.05 + method_2(200000)
    elif i > 100000:
        return (i - 100000) * 0.075 + method_2(100000)
    else:
        return i * 0.1


# 最简单的条件判断
def method_3(i):
    if i > 1000000:
        return (i - 1000000) * 0.01 + 400000 * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif i > 600000:
        return (i - 600000) * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif i > 400000:
        return (i - 400000) * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif i > 200000:
        return (i - 200000) * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif i > 100000:
        return (i - 100000) * 0.075 + 100000 * 0.1
    else:
        return i * 0.1


if __name__ == '__main__':
    i = int(input('净利润:'))
    print("方法一的结果为:{}".format(method_1(i)))
    print("方法二的结果为:{}".format(method_2(i)))
    print("方法三的结果为:{}".format(method_3(i)))
